<center>
<table style="border:none">
    <tr style="border:none">
    <th style="border:none">
        <a  href='https://colab.research.google.com/github/AmirMardan/ml_course/blob/main/3_pandas/1_data_manipulation_using_pandas.ipynb'><img src='https://colab.research.google.com/assets/colab-badge.svg'></a>
    </th>
    <th style="border:none">
        <a  href='https://github1s.com/AmirMardan/ml_course/blob/main/3_pandas/1_data_manipulation_using_pandas.ipynb'><img src='../imgs/open_vscode.svg' height=20px width=115px></a>
    </th>
    </tr>
</table>
</center>


This notebook is created by <a href='https://github.com/AmirMardan'> Amir Mardan</a>. For any feedback or suggestion, please contact me via my <a href="mailto:mardan.amir.h@gmail.com">email</a>, (mardan.amir.h@gmail.com).

<center>
<img id='PYTHON' src='img/pandas.svg' width='300px'>
</center>

<a name='top'></a>
# Data manipulation using pandas

This notebook will cover the following topics:
- [1. Basic operations in pandas](#operation)
- [2. Combining datasets](#combine)
    - [Concat](#concat)
    - [Merge](#merge)
    - [Join](#join)
- [3. Aggregation](#aggregation)
- [4. `Groupby`](#groupby)
- [5. Vectorized string](#vectorized_string)

In [121]:
import numpy as np
import pandas as pd

<div class="alert alert-block alert-success">
<b>Reminder:</b> We can always get access to documentation of a function using <code>help(function_name)</code>.
</div>

<a name='operation'></a>
## 1. Basic operations in pandas

Pandas inherits the functionality of NumPy.

In [122]:
# Let's create a dataframe

df = pd.DataFrame({'Property type':['car', 'apartment', 'mansion', 'Car liability'],
                   'Number of insured': [100, 69, 6, 80],
                   'Value': [2e6, 350e6, 12e6, 1.6e6],
                   'High risk': [True, np.nan, False, False]})

df

   Property type  Number of insured        Value High risk
0            car                100    2000000.0      True
1      apartment                 69  350000000.0       NaN
2        mansion                  6   12000000.0     False
3  Car liability                 80    1600000.0     False

**Basic information about dataframes**

We can use the method `info()` of a dataframe to get a  summary of the dataframe (df)

- `Column`
- `Non-Null Count`
- `Dtype`
- `memory usage`

In [123]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Property type      4 non-null      object
 1   Number of insured  4 non-null      int64
 2   Value              4 non-null      float64
 3   High risk          3 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 256.0+ bytes

The `head(n)` and `tail(n)` methods of dataframe return the `n` first and last samples of dataframe.

In [124]:
# Return 2 first rows

df.head(2)

  Property type  Number of insured        Value High risk
0           car                100    2000000.0      True
1     apartment                 69  350000000.0       NaN

In [125]:
# Return 2 last rows

df.tail(2)

   Property type  Number of insured       Value High risk
2        mansion                  6  12000000.0     False
3  Car liability                 80   1600000.0     False

**Size and shape**

In [126]:
# Get the size of dataframe

df.size

16

In [127]:
# Get the shape of dataframe

df.shape

(4, 4)

**Apply function on dataframes**

In [128]:
# Let's drop the bolean column

df_numeric = df.drop('High risk', axis=1)
df_numeric

   Property type  Number of insured        Value
0            car                100    2000000.0
1      apartment                 69  350000000.0
2        mansion                  6   12000000.0
3  Car liability                 80    1600000.0

In [129]:
# We can apply functions from NumPy on dataframes

np.log10(df_numeric.iloc[:, 1:])

   Number of insured     Value
0           2.000000  6.301030
1           1.838849  8.544068
2           0.778151  7.079181
3           1.903090  6.204120

To apply a function along an axis, we use `apply()` method.

In [130]:
def sqrt(x):
    return np.sqrt(x)

df_numeric.iloc[:, 1:].apply(sqrt, axis=1)

   Number of insured         Value
0          10.000000   1414.213562
1           8.306624  18708.286934
2           2.449490   3464.101615
3           8.944272   1264.911064

**Sorting values**

In [131]:
# Sort the dataframe by Number of insured

df.sort_values('Number of insured')

   Property type  Number of insured        Value High risk
2        mansion                  6   12000000.0     False
1      apartment                 69  350000000.0       NaN
3  Car liability                 80    1600000.0     False
0            car                100    2000000.0      True

In [132]:
# Sort the dataframe by Number of insured

df.sort_values('Number of insured', ascending=False)

   Property type  Number of insured        Value High risk
0            car                100    2000000.0      True
3  Car liability                 80    1600000.0     False
1      apartment                 69  350000000.0       NaN
2        mansion                  6   12000000.0     False

<a name='combine'></a>
## 2. Combining datasets

<a name='concat'></a>
### 2.1 Concat

In [133]:
# Recall

x = [1 , 3]
y = [4, 2]

np.concatenate([x, y])

array([1, 3, 4, 2])

In [134]:
# Let's create dataframes

df1 = pd.DataFrame([['a', 1], ['b', 2]],
                   columns=['letter', 'number'])

df2 = pd.DataFrame([['c', 3], ['d', 4]],
                   columns=['letter', 'number'])

df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
                   columns=['letter', 'number', 'animal'])

In [135]:
df1

  letter  number
0      a       1
1      b       2

In [136]:
df2

  letter  number
0      c       3
1      d       4

In [137]:
df3

  letter  number animal
0      c       3    cat
1      d       4    dog

**Syntax**

```Python
# pandas v. 1.4.1

pandas.concat(objs, axis=0, join='outer', ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, sort=False, copy=True)
```

In [138]:
# Combine two DataFrame objects with identical columns.


pd.concat([df1, df2])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [139]:
# Combine two DataFrame by defining axis

pd.concat([df1, df2], axis=1)

  letter  number letter  number
0      a       1      c       3
1      b       2      d       4

In [140]:
# Concatenation with different shape
# Columns outside the intersection will be filled with NaN values.

pd.concat([df1, df3])

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [141]:
# Concatenation with different shape: by using 'inner join', we just use shared columns

pd.concat([df1, df3], join='inner')

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

<a name='merge'></a>
### 2.2 Merge

Merge DataFrame or Series objects.

**Syntax**
```Python
# pandas v. 1.4.1

DataFrame.merge(right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)
```

In [142]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})

df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})

In [143]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [144]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

**One-to-one joins**

Similar to the column-wise concatenation

In [145]:
df3 = df1.merge(df2)

df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

**Many-to-one joins**

When one of the two key columns contains duplicate entries (`'group'`)

In [146]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})

df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [147]:
df3.merge(df4)  # df3.merge(df4, on='group')

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

**Many-to-many joins**

If the key column in both the left and right array contains duplicates, then the result is a many-to-many merge.

In [148]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting', 'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux', 'spreadsheets', 'organization']})

df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [149]:
df1.merge(df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [150]:
# Merge df1 and df2 on the lkey and rkey columns.
df1.merge(df2)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

**The `on` keyword**

We can explicitly specify the name of the key column using the `on` keyword.

In [151]:
df1.merge(df2, on="employee")

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

**The `left_on` and `right_on` keyword**

if you wish to merge two datasets with different column names

In [152]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})

df3

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [153]:
df1.merge(df3, left_on='employee', right_on='name')

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

The result has a redundant column. We can drop it using `drop()`.

In [154]:
df1.merge(df3, left_on='employee', right_on='name').drop('name', axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

**The `left_index` and `right_index` keyword**

If we want to merge based on an index.

In [155]:
df1a = df1.set_index('employee')
df1a

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

In [156]:
df2a = df2.set_index('employee')
df2a

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [157]:
df1a.merge(df2a, left_index=True, right_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

If we want to use the index of one dataset and column of the other.

In [158]:
df1a.merge(df2, left_index=True, right_on='employee')

         group employee  hire_date
1   Accounting      Bob       2008
2  Engineering     Jake       2012
0  Engineering     Lisa       2004
3           HR      Sue       2014

<a name='join'></a>
### 2.3 Join

For convenience, `DataFrames` implement the `join()` method, which performs a merge that defaults to joining on indices

In [159]:
df1a.join(df2a)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

<a name='aggregation'></a>
## 3. Aggregation

An efficient summarization of data is really important.

In [160]:
# Download the data

!curl -O https://raw.githubusercontent.com/AmirMardan/ml_course/main/data/house_intro_pandas.csv

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100   949  100   949    0     0   2544      0 --:--:-- --:--:-- --:--:--  2544

In [161]:
# Load data

df = pd.read_csv('./house_intro_pandas.csv')
# df = df.loc[:, ['bedroom', 'price', 'area']]

df.head()

   bedroom    price    area    furnish_type  bathroom       city
0      2.0  20000.0  1450.0       Furnished       2.0  Ahmedabad
1      1.0   7350.0   210.0  Semi-Furnished       1.0  Ahmedabad
2      3.0  22000.0  1900.0     Unfurnished       3.0  Ahmedabad
3      2.0  13000.0  1285.0  Semi-Furnished       2.0  Ahmedabad
4      2.0  18000.0  1600.0       Furnished       2.0  Ahmedabad

In [162]:
# Get the summary

df.describe()

         bedroom         price         area   bathroom
count  20.000000     20.000000    20.000000  20.000000
mean    1.950000  14842.500000  1140.750000   1.900000
std     0.825578   7958.035909   755.841314   0.852242
min     1.000000   6000.000000   160.000000   1.000000
25%     1.000000   8375.000000   750.000000   1.000000
50%     2.000000  13000.000000  1085.000000   2.000000
75%     2.000000  20000.000000  1442.500000   2.000000
max     4.000000  38500.000000  3500.000000   4.000000

In [163]:
# Mean

df.mean(numeric_only=True)

bedroom         1.95
price       14842.50
area         1140.75
bathroom        1.90
dtype: float64

In [164]:
# Median

df.median(numeric_only=True)

bedroom         2.0
price       13000.0
area         1085.0
bathroom        2.0
dtype: float64

In [165]:
# Mode

df.mode().loc[0, :]

bedroom                    2.0
price                  20000.0
area                     160.0
furnish_type    Semi-Furnished
bathroom                   2.0
city                 Ahmedabad
Name: 0, dtype: object

In [166]:
# Variance

df.var(numeric_only=True)

bedroom     6.815789e-01
price       6.333034e+07
area        5.712961e+05
bathroom    7.263158e-01
dtype: float64

In [167]:
# Standard deviation

df.std(numeric_only=True)

bedroom        0.825578
price       7958.035909
area         755.841314
bathroom       0.852242
dtype: float64

In [168]:
df.sum(numeric_only=True)

bedroom         39.0
price       296850.0
area         22815.0
bathroom        38.0
dtype: float64

`count()` for total number of items

In [169]:
df.count()

bedroom         20
price           20
area            20
furnish_type    20
bathroom        20
city            20
dtype: int64

In [170]:
# Product of all values

df.prod(numeric_only=True)

bedroom     1.105920e+05
price       2.196758e+82
area        9.017523e+58
bathroom    5.529600e+04
dtype: float64

<a name='groupby'></a>
## 4. `Groupby`

A `groupby` operation involves some combination of splitting the object, applying a function, and combining the results.

**Syntax** 
```Python
# pandas v. 1.4.1

DataFrame.groupby(by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, squeeze=NoDefault.no_default, observed=False, dropna=True)
```

In [171]:
# Let's group by bumber of beddrom

df.groupby(by='bedroom').mean()

                price         area  bathroom
bedroom
1.0       8225.000000   420.000000  1.166667
2.0      14700.000000  1165.500000  1.800000
3.0      20666.666667  1713.333333  3.000000
4.0      38500.000000  3500.000000  4.000000

In [172]:
df.groupby(by='bedroom').median()

           price    area  bathroom
bedroom
1.0       7675.0   305.0       1.0
2.0      13000.0  1163.0       2.0
3.0      20000.0  1800.0       3.0
4.0      38500.0  3500.0       4.0

In [173]:
# Group by 2 features

df.groupby(by=[ 'bedroom', 'bathroom']).median()

                    price    area
bedroom bathroom
1.0     1.0        7350.0   210.0
        2.0       13500.0  1000.0
2.0     1.0       15750.0  1075.0
        2.0       13000.0  1163.0
3.0     3.0       20000.0  1800.0
4.0     4.0       38500.0  3500.0

In [174]:
# Seperate based on data type

df_numeric = df.select_dtypes(include=[int, float])

In [175]:
# Using aggregation for multiple functions

df_numeric.groupby(by=[ 'bedroom', 'bathroom']).aggregate(func=['min', 'max'])

                    price             area
                      min      max     min     max
bedroom bathroom
1.0     1.0        6000.0   8500.0   160.0   570.0
        2.0       13500.0  13500.0  1000.0  1000.0
2.0     1.0        6500.0  25000.0   900.0  1250.0
        2.0       12000.0  20000.0   810.0  1600.0
3.0     3.0       20000.0  22000.0  1440.0  1900.0
4.0     4.0       38500.0  38500.0  3500.0  3500.0

<a name='vectorized_string'></a>
## 5. Vectorized string

Pandas has inetersting functionality to work with strings.

In [176]:
# Let's create a Series

data = ['peter', 'Paul', None, 'MARY', 'gUIDO']

names = pd.Series(data)

names

0    peter
1     Paul
2     None
3     MARY
4    gUIDO
dtype: object

In [178]:
# Capitalize strings 

names.str.capitalize()

0    Peter
1     Paul
2     None
3     Mary
4    Guido
dtype: object

In [179]:
# Get the length of string

names.str.len()

0    5.0
1    4.0
2    NaN
3    4.0
4    5.0
dtype: float64

In [181]:
# Make strings uppercase

names.str.upper()

0    PETER
1     PAUL
2     None
3     MARY
4    GUIDO
dtype: object

**Methods for strings**

<table>
      <tr>
            <td><code>len()</code></td>
            <td><code>ljust()</code></td>
            <td><code>rjust()</code></td>
            <td><code>center()</code></td>
      </tr>
      <tr>
            <td><code> zfill() </code></td>
            <td><code> strip() </code></td>
            <td><code> index() </code></td>
            <td><code> rindex() </code></td>
      </tr>
      <tr>
            <td><code> capitalize() </code></td>
            <td><code> translate() </code></td>
            <td><code> islower() </code></td>
            <td><code> upper() </code></td>
      </tr>
      <tr>
            <td><code> startwith() </code></td>
            <td><code> isupper() </code></td>
            <td><code> find() </code></td>
            <td><code> endwith() </code></td>
      </tr>
      <tr>
            <td><code> isnumeric() </code></td>
            <td><code> isalpha() </code></td>
            <td><code> split() </code></td>
            <td><code> isdigit() </code></td>
      </tr>
      <tr>
            <td><code> rsplit() </code></td>
            <td><code> isspace() </code></td>
            <td><code> partition() </code></td>
            <td><code> swapcase() </code></td>
      </tr>
      <tr>
            <td><code> istitle() </code></td>
            <td><code> rpartition() </code></td>
            <td><code> rstrip() </code></td>
            <td><code> lstrip() </code></td>
      </tr>

</table>

### [TOP ](#top)